Revit 2027 API
BuiltInFailures.SketchFailures.ContainedInOtherLoops Property
 When creating an opening, you cannot sketch loops within other loops. The highlighted loop(s) are contained within another loop.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ContainedInOtherLoops { get; }
Public Shared ReadOnly Property ContainedInOtherLoops As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ContainedInOtherLoops {
	FailureDefinitionId^ get ();
}
static member ContainedInOtherLoops : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace